tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1708_tdd.h
#define DHEN                          522
#define AHEN                          523
#define SBCDE                         524
#define SDAHT                         525
#define BOEN                          526
#define SCIE                          527
#define PCIE                          528
#define ACKTIM                        529
#define ODCONA                        530
#define ODA0                          531
#define ODA1                          532
#define ODA2                          533
#define ODA4                          534
#define ODA5                          535
#define ODCONB                        536
#define ODB4                          537
#define ODB5                          538
#define ODB6                          539
#define ODB7                          540
#define ODCONC                        541
#define ODC0                          542
#define ODC1                          543
#define ODC2                          544
#define ODC3                          545
#define ODC4                          546
#define ODC5                          547
#define ODC6                          548
#define ODC7                          549
#define CCPR1L                        550
#define CCPR1H                        551
#define CCP1CON                       552
#define CCP1M0                        553
#define CCP1M                         554
#define CCP1M1                        555
#define CCP1M2                        556
#define CCP1M3                        557
#define CCP1Y                         558
#define DC1B                          559
#define DC1B0                         560
#define CCP1X                         561
#define DC1B1                         562
#define CCPR2L                        563
#define CCPR2H                        564
#define CCP2CON                       565
#define CCP2M                         566
#define CCP2M0                        567
#define CCP2M1                        568
#define CCP2M2                        569
#define CCP2M3                        570
#define DC2B0                         571
#define CCP2Y                         572
#define DC2B                          573
#define DC2B1                         574
#define CCP2X                         575
#define CCPTMRS                       576
#define C1TSEL0                       577
#define C1TSEL                        578
#define C1TSEL1                       579
#define C2TSEL0                       580
#define C2TSEL                        581
#define C2TSEL1                       582
#define P3TSEL                        583
#define P3TSEL0                       584
#define P3TSEL1                       585
#define P4TSEL0                       586
#define P4TSEL                        587
#define P4TSEL1                       588
#define SLRCONA                       589
#define SLRA0                         590
#define SLRA1                         591
#define SLRA2                         592
#define SLRA4                         593
#define SLRA5                         594
#define SLRCONB                       595
#define SLRB4                         596
#define SLRB5                         597
#define SLRB6                         598
#define SLRB7                         599
#define SLRCONC                       600
#define SLRC0                         601
#define SLRC1                         602
#define SLRC2                         603
#define SLRC3                         604
#define SLRC4                         605
#define SLRC5                         606
#define SLRC6                         607
#define SLRC7                         608
#define INLVLA                        609
#define INLVLA0                       610
#define INLVLA1                       611
#define INLVLA2                       612
#define INLVLA3                       613
#define INLVLA4                       614
#define INLVLA5                       615
#define INLVLB                        616
#define INLVLB4                       617
#define INLVLB5                       618
#define INLVLB6                       619
#define INLVLB7                       620
#define INLVLC                        621
#define INLVLC0                       622
#define INLVLC1                       623
#define INLVLC2                       624
#define INLVLC3                       625
#define INLVLC4                       626
#define INLVLC5                       627
#define INLVLC6                       628
#define INLVLC7                       629
#define IOCAP                         630
#define IOCAP0                        631
#define IOCAP1                        632
#define IOCAP2                        633
#define IOCAP3                        634
#define IOCAP4                        635
#define IOCAP5                        636
#define IOCAN                         637
#define IOCAN0                        638
#define IOCAN1                        639
#define IOCAN2                        640
#define IOCAN3                        641
#define IOCAN4                        642
#define IOCAN5                        643
#define IOCAF                         644
#define IOCAF0                        645
#define IOCAF1                        646
#define IOCAF2                        647
#define IOCAF3                        648
#define IOCAF4                        649
#define IOCAF5                        650
#define IOCBP                         651
#define IOCBP4                        652
#define IOCBP5                        653
#define IOCBP6                        654
#define IOCBP7                        655
#define IOCBN                         656
#define IOCBN4                        657
#define IOCBN5                        658
#define IOCBN6                        659
#define IOCBN7                        660
#define IOCBF                         661
#define IOCBF4                        662
#define IOCBF5                        663
#define IOCBF6                        664
#define IOCBF7                        665
#define IOCCP                         666
#define IOCCP0                        667
#define IOCCP1                        668
#define IOCCP2                        669
#define IOCCP3                        670
#define IOCCP4                        671
#define IOCCP5                        672
#define IOCCP6                        673
#define IOCCP7                        674
#define IOCCN                         675
#define IOCCN0                        676
#define IOCCN1                        677
#define IOCCN2                        678
#define IOCCN3                        679
#define IOCCN4                        680
#define IOCCN5                        681
#define IOCCN6                        682
#define IOCCN7                        683
#define IOCCF                         684
#define IOCCF0                        685
#define IOCCF1                        686
#define IOCCF2                        687
#define IOCCF3                        688
#define IOCCF4                        689
#define IOCCF5                        690
#define IOCCF6                        691
#define IOCCF7                        692
#define TMR4                          693
#define PR4                           694
#define T4CON                         695
#define T4CKPS0                       696
#define T4CKPS                        697
#define T4CKPS1                       698
#define TMR4ON                        699
#define T4OUTPS                       700
#define T4OUTPS0                      701
#define T4OUTPS1                      702
#define T4OUTPS2                      703
#define T4OUTPS3                      704
#define TMR6                          705
#define PR6                           706
#define T6CON                         707
#define T6CKPS0                       708
#define T6CKPS                        709
#define T6CKPS1                       710
#define TMR6ON                        711
#define T6OUTPS0                      712
#define T6OUTPS                       713
#define T6OUTPS1                      714
#define T6OUTPS2                      715
#define T6OUTPS3                      716
#define OPA1CON                       717
#define OPA1PCH                       718
#define OPA1PCH0                      719
#define OPA1PCH1                      720
#define OPA1UG                        721
#define OPA1SP                        722
#define OPA1EN                        723
#define OPA2CON                       724
#define OPA2PCH                       725
#define OPA2PCH0                      726
#define OPA2PCH1                      727
#define OPA2UG                        728
#define OPA2SP                        729
#define OPA2EN                        730
#define PWM3DCL0                      731
#define PWM3DCL                       732
#define PWM3DCL1                      733
#define PWM3DCH0                      734
#define PWM3DCH                       735
#define PWM3DCH1                      736
#define PWM3DCH2                      737
#define PWM3DCH3                      738
#define PWM3DCH4                      739
#define PWM3DCH5                      740
#define PWM3DCH6                      741
#define PWM3DCH7                      742
#define PWM3CON                       743
#define PWM3POL                       744
#define PWM3OUT                       745
#define PWM3EN                        746
#define PWM4DCL                       747
#define PWM4DCL0                      748
#define PWM4DCL1                      749
#define PWM4DCH0                      750
#define PWM4DCH                       751
#define PWM4DCH1                      752
#define PWM4DCH2                      753
#define PWM4DCH3                      754
#define PWM4DCH4                      755
#define PWM4DCH5                      756
#define PWM4DCH6                      757
#define PWM4DCH7                      758
#define PWM4CON                       759
#define PWM4POL                       760
#define PWM4OUT                       761
#define PWM4EN                        762
#define COG1PHR                       763
#define G1PHR                         764
#define G1PHR0                        765
#define G1PHR1                        766
#define G1PHR2                        767
#define G1PHR3                        768
#define G1PHR4                        769
#define G1PHR5                        770
#define COG1PHF                       771
#define G1PHF0                        772
#define G1PHF                         773
#define G1PHF1                        774
#define G1PHF2                        775
#define G1PHF3                        776
#define G1PHF4                        777
#define G1PHF5                        778
#define COG1BLKR                      779
#define G1BLKR                        780
#define G1BLKR0                       781
#define G1BLKR1                       782
#define G1BLKR2                       783
#define G1BLKR3                       784
#define G1BLKR4                       785
#define G1BLKR5                       786
#define COG1BLKF                      787
#define G1BLKF                        788
#define G1BLKF0                       789
#define G1BLKF1                       790
#define G1BLKF2                       791
#define G1BLKF3                       792
#define G1BLKF4                       793
#define G1BLKF5                       794
#define COG1DBR                       795
#define G1DBR0                        796
#define G1DBR                         797
#define G1DBR1                        798
#define G1DBR2                        799
#define G1DBR3                        800
#define G1DBR4                        801
#define G1DBR5                        802
#define COG1DBF                       803
#define G1DBF0                        804
#define G1DBF                         805
#define G1DBF1                        806
#define G1DBF2                        807
#define G1DBF3                        808
#define G1DBF4                        809
#define G1DBF5                        810
#define COG1CON0                      811
#define G1MD0                         812
#define G1MD                          813
#define G1MD1                         814
#define G1MD2                         815
#define G1CS0                         816
#define G1CS                          817
#define G1CS1                         818
#define G1LD                          819
#define G1EN                          820
#define COG1CON1                      821
#define G1POLA                        822
#define G1POLB                        823
#define G1POLC                        824
#define G1POLD                        825
#define G1FDBS                        826
#define G1RDBS                        827
#define COG1RIS                       828
#define G1RIS0                        829
#define G1RIS1                        830
#define G1RIS2                        831
#define G1RIS3                        832
#define G1RIS4                        833
#define G1RIS5                        834
#define G1RIS6                        835
#define COG1RSIM                      836
#define G1RSIM0                       837
#define G1RSIM1                       838
#define G1RSIM2                       839
#define G1RSIM3                       840
#define G1RSIM4                       841
#define G1RSIM5                       842
#define G1RSIM6                       843
#define COG1FIS                       844
#define G1FIS0                        845
#define G1FIS1                        846
#define G1FIS2                        847
#define G1FIS3                        848
#define G1FIS4                        849
#define G1FIS5                        850
#define G1FIS6                        851
#define COG1FSIM                      852
#define G1FSIM0                       853
#define G1FSIM1                       854
#define G1FSIM2                       855
#define G1FSIM3                       856
#define G1FSIM4                       857
#define G1FSIM5                       858
#define G1FSIM6                       859
#define COG1ASD0                      860
#define G1ASDAC0                      861
#define G1ASDAC                       862
#define G1ASDAC1                      863
#define G1ASDBD0                      864
#define G1ASDBD                       865
#define G1ASDBD1                      866
#define G1ARSEN                       867
#define G1ASE                         868
#define COG1ASD1                      869
#define G1AS0E                        870
#define G1AS1E                        871
#define G1AS2E                        872
#define G1AS3E                        873
#define COG1STR                       874
#define G1STRA                        875
#define G1STRB                        876
#define G1STRC                        877
#define G1STRD                        878
#define G1SDATA                       879
#define G1SDATB                       880
#define G1SDATC                       881
#define G1SDATD                       882
#define PPSLOCK                       883
#define PPSLOCKED                     884
#define INTPPS                        885
#define T0CKIPPS                      886
#define T1CKIPPS                      887
#define T1GPPS                        888
#define CCP1PPS                       889
#define CCP2PPS                       890
#define COGINPPS                      891
#define SSPCLKPPS                     892
#define SSPDATPPS                     893
#define SSPSSPPS                      894
#define RXPPS                         895
#define CKPPS                         896
#define CLCIN0PPS                     897
#define CLCIN1PPS                     898
#define CLCIN2PPS                     899
#define CLCIN3PPS                     900
#define RA0PPS                        901
#define RA1PPS                        902
#define RA2PPS                        903
#define RA4PPS                        904
#define RA5PPS                        905
#define RB4PPS                        906
#define RB5PPS                        907
#define RB6PPS                        908
#define RB7PPS                        909
#define RC0PPS                        910
#define RC1PPS                        911
#define RC2PPS                        912
#define RC3PPS                        913
#define RC4PPS                        914
#define RC5PPS                        915
#define RC6PPS                        916
#define RC7PPS                        917
#define CLCDATA                       918
#define MCLC1OUT                      919
#define MCLC2OUT                      920
#define MCLC3OUT                      921
#define CLC1CON                       922
#define CLC1CON_MODE                  923
#define LC1MODE0                      924
#define LC1MODE                       925
#define CLC1CON_MODE0                 926
#define LC1MODE1                      927
#define CLC1CON_MODE1                 928
#define CLC1CON_MODE2                 929
#define LC1MODE2                      930
#define LC1INTN                       931
#define CLC1CON_INTN                  932
#define LC1INTP                       933
#define CLC1CON_INTP                  934
#define CLC1CON_OUT                   935
#define LC1OUT                        936
#define LC1EN                         937
#define CLC1CON_EN                    938
#define CLC1POL                       939
#define LC1G1POL                      940
#define CLC1POL_G1POL                 941
#define CLC1POL_G2POL                 942
#define LC1G2POL                      943
#define LC1G3POL                      944
#define CLC1POL_G3POL                 945
#define LC1G4POL                      946
#define CLC1POL_G4POL                 947
#define CLC1POL_POL                   948
#define LC1POL                        949
#define CLC1SEL0                      950
#define CLC1SEL0_D1S0                 951
#define LC1D1S                        952
#define LC1D1S0                       953
#define CLC1SEL0_D1S                  954
#define CLC1SEL0_D1S1                 955
#define LC1D1S1                       956
#define CLC1SEL0_D1S2                 957
#define LC1D1S2                       958
#define CLC1SEL0_D1S3                 959
#define LC1D1S3                       960
#define CLC1SEL0_D1S4                 961
#define LC1D1S4                       962
#define CLC1SEL1                      963
#define CLC1SEL1_D2S0                 964
#define CLC1SEL1_D2S                  965
#define LC1D2S                        966
#define LC1D2S0                       967
#define CLC1SEL1_D2S1                 968
#define LC1D2S1                       969
#define LC1D2S2                       970
#define CLC1SEL1_D2S2                 971
#define LC1D2S3                       972
#define CLC1SEL1_D2S3                 973
#define LC1D2S4                       974
#define CLC1SEL1_D2S4                 975
#define CLC1SEL2                      976
#define LC1D3S0                       977
#define CLC1SEL2_D3S                  978
#define LC1D3S                        979
#define CLC1SEL2_D3S0                 980
#define LC1D3S1                       981
#define CLC1SEL2_D3S1                 982
#define LC1D3S2                       983
#define CLC1SEL2_D3S2                 984
#define LC1D3S3                       985
#define CLC1SEL2_D3S3                 986
#define LC1D3S4                       987
#define CLC1SEL2_D3S4                 988
#define CLC1SEL3                      989
#define CLC1SEL3_D4S                  990
#define LC1D4S                        991
#define LC1D4S0                       992
#define CLC1SEL3_D4S0                 993
#define CLC1SEL3_D4S1                 994
#define LC1D4S1                       995
#define LC1D4S2                       996
#define CLC1SEL3_D4S2                 997
#define LC1D4S3                       998
#define CLC1SEL3_D4S3                 999
#define LC1D4S4                       1000
#define CLC1SEL3_D4S4                 1001
#define CLC1GLS0                      1002
#define CLC1GLS0_D1N                  1003
#define LC1G1D1N                      1004
#define CLC1GLS0_D1T                  1005
#define LC1G1D1T                      1006
#define LC1G1D2N                      1007
#define CLC1GLS0_D2N                  1008
#define LC1G1D2T                      1009
#define CLC1GLS0_D2T                  1010
#define CLC1GLS0_D3N                  1011
#define LC1G1D3N                      1012
#define CLC1GLS0_D3T                  1013
#define LC1G1D3T                      1014
#define CLC1GLS0_D4N                  1015
#define LC1G1D4N                      1016
#define CLC1GLS0_D4T                  1017
#define LC1G1D4T                      1018
#define CLC1GLS1                      1019
#define CLC1GLS1_D1N                  1020
#define LC1G2D1N                      1021
#define LC1G2D1T                      1022
#define CLC1GLS1_D1T                  1023
#define CLC1GLS1_D2N                  1024
#define LC1G2D2N                      1025
#define LC1G2D2T                      1026
#define CLC1GLS1_D2T                  1027
#define CLC1GLS1_D3N                  1028
#define LC1G2D3N                      1029
#define LC1G2D3T                      1030
#define CLC1GLS1_D3T                  1031
#define CLC1GLS1_D4N                  1032
#define LC1G2D4N                      1033
#define LC1G2D4T                      1034
#define CLC1GLS1_D4T                  1035
#define CLC1GLS2                      1036
#define CLC1GLS2_D1N                  1037
#define LC1G3D1N                      1038
#define LC1G3D1T                      1039
#define CLC1GLS2_D1T                  1040
#define LC1G3D2N                      1041
#define CLC1GLS2_D2N                  1042
#define LC1G3D2T                      1043
#define CLC1GLS2_D2T                  1044
#define CLC1GLS2_D3N                  1045
#define LC1G3D3N                      1046
#define LC1G3D3T                      1047
#define CLC1GLS2_D3T                  1048
#define LC1G3D4N                      1049
#define CLC1GLS2_D4N                  1050
#define LC1G3D4T                      1051
#define CLC1GLS2_D4T                  1052
#define CLC1GLS3                      1053
#define LC1G4D1N                      1054
#define CLC1GLS3_G4D1N                1055
#define LC1G4D1T                      1056
#define CLC1GLS3_G4D1T                1057
#define CLC1GLS3_G4D2N                1058
#define LC1G4D2N                      1059
#define CLC1GLS3_G4D2T                1060
#define LC1G4D2T                      1061
#define LC1G4D3N                      1062
#define CLC1GLS3_G4D3N                1063
#define LC1G4D3T                      1064
#define CLC1GLS3_G4D3T                1065
#define CLC1GLS3_G4D4N                1066
#define LC1G4D4N                      1067
#define CLC1GLS3_G4D4T                1068
#define LC1G4D4T                      1069
#define CLC2CON                       1070
#define LC2MODE0                      1071
#define CLC2CON_MODE                  1072
#define LC2MODE                       1073
#define CLC2CON_MODE0                 1074
#define LC2MODE1                      1075
#define CLC2CON_MODE1                 1076
#define LC2MODE2                      1077
#define CLC2CON_MODE2                 1078
#define LC2INTN                       1079
#define CLC2CON_INTN                  1080
#define LC2INTP                       1081
#define CLC2CON_INTP                  1082
#define CLC2CON_OUT                   1083
#define LC2OUT                        1084
#define CLC2CON_EN                    1085
#define LC2EN                         1086
#define CLC2POL                       1087
#define LC2G1POL                      1088
#define CLC2POL_G1POL                 1089
#define LC2G2POL                      1090
