tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1708_tdd.h
#define CLC2POL_G2POL                 1091
#define LC2G3POL                      1092
#define CLC2POL_G3POL                 1093
#define LC2G4POL                      1094
#define CLC2POL_G4POL                 1095
#define CLC2POL_POL                   1096
#define LC2POL                        1097
#define CLC2SEL0                      1098
#define CLC2SEL0_D1S                  1099
#define LC2D1S0                       1100
#define CLC2SEL0_D1S0                 1101
#define LC2D1S                        1102
#define LC2D1S1                       1103
#define CLC2SEL0_D1S1                 1104
#define LC2D1S2                       1105
#define CLC2SEL0_D1S2                 1106
#define CLC2SEL0_D1S3                 1107
#define LC2D1S3                       1108
#define LC2D1S4                       1109
#define CLC2SEL0_D1S4                 1110
#define CLC2SEL1                      1111
#define LC2D2S0                       1112
#define CLC2SEL1_D2S0                 1113
#define LC2D2S                        1114
#define CLC2SEL1_D2S                  1115
#define LC2D2S1                       1116
#define CLC2SEL1_D2S1                 1117
#define LC2D2S2                       1118
#define CLC2SEL1_D2S2                 1119
#define LC2D2S3                       1120
#define CLC2SEL1_D2S3                 1121
#define LC2D2S4                       1122
#define CLC2SEL1_D2S4                 1123
#define CLC2SEL2                      1124
#define CLC2SEL2_D3S                  1125
#define LC2D3S0                       1126
#define CLC2SEL2_D3S0                 1127
#define LC2D3S                        1128
#define CLC2SEL2_D3S1                 1129
#define LC2D3S1                       1130
#define LC2D3S2                       1131
#define CLC2SEL2_D3S2                 1132
#define LC2D3S3                       1133
#define CLC2SEL2_D3S3                 1134
#define LC2D3S4                       1135
#define CLC2SEL2_D3S4                 1136
#define CLC2SEL3                      1137
#define LC2D4S                        1138
#define LC2D4S0                       1139
#define CLC2SEL3_D4S                  1140
#define CLC2SEL3_D4S0                 1141
#define LC2D4S1                       1142
#define CLC2SEL3_D4S1                 1143
#define LC2D4S2                       1144
#define CLC2SEL3_D4S2                 1145
#define CLC2SEL3_D4S3                 1146
#define LC2D4S3                       1147
#define LC2D4S4                       1148
#define CLC2SEL3_D4S4                 1149
#define CLC2GLS0                      1150
#define LC2G1D1N                      1151
#define CLC2GLS0_D1N                  1152
#define CLC2GLS0_D1T                  1153
#define LC2G1D1T                      1154
#define LC2G1D2N                      1155
#define CLC2GLS0_D2N                  1156
#define CLC2GLS0_D2T                  1157
#define LC2G1D2T                      1158
#define LC2G1D3N                      1159
#define CLC2GLS0_D3N                  1160
#define CLC2GLS0_D3T                  1161
#define LC2G1D3T                      1162
#define LC2G1D4N                      1163
#define CLC2GLS0_D4N                  1164
#define CLC2GLS0_D4T                  1165
#define LC2G1D4T                      1166
#define CLC2GLS1                      1167
#define CLC2GLS1_D1N                  1168
#define LC2G2D1N                      1169
#define CLC2GLS1_D1T                  1170
#define LC2G2D1T                      1171
#define CLC2GLS1_D2N                  1172
#define LC2G2D2N                      1173
#define CLC2GLS1_D2T                  1174
#define LC2G2D2T                      1175
#define LC2G2D3N                      1176
#define CLC2GLS1_D3N                  1177
#define LC2G2D3T                      1178
#define CLC2GLS1_D3T                  1179
#define LC2G2D4N                      1180
#define CLC2GLS1_D4N                  1181
#define LC2G2D4T                      1182
#define CLC2GLS1_D4T                  1183
#define CLC2GLS2                      1184
#define LC2G3D1N                      1185
#define CLC2GLS2_D1N                  1186
#define CLC2GLS2_D1T                  1187
#define LC2G3D1T                      1188
#define CLC2GLS2_D2N                  1189
#define LC2G3D2N                      1190
#define LC2G3D2T                      1191
#define CLC2GLS2_D2T                  1192
#define CLC2GLS2_D3N                  1193
#define LC2G3D3N                      1194
#define CLC2GLS2_D3T                  1195
#define LC2G3D3T                      1196
#define CLC2GLS2_D4N                  1197
#define LC2G3D4N                      1198
#define LC2G3D4T                      1199
#define CLC2GLS2_D4T                  1200
#define CLC2GLS3                      1201
#define LC2G4D1N                      1202
#define CLC2GLS3_G4D1N                1203
#define CLC2GLS3_G4D1T                1204
#define LC2G4D1T                      1205
#define CLC2GLS3_G4D2N                1206
#define LC2G4D2N                      1207
#define LC2G4D2T                      1208
#define CLC2GLS3_G4D2T                1209
#define CLC2GLS3_G4D3N                1210
#define LC2G4D3N                      1211
#define CLC2GLS3_G4D3T                1212
#define LC2G4D3T                      1213
#define LC2G4D4N                      1214
#define CLC2GLS3_G4D4N                1215
#define CLC2GLS3_G4D4T                1216
#define LC2G4D4T                      1217
#define CLC3CON                       1218
#define LC3MODE0                      1219
#define CLC3CON_MODE0                 1220
#define CLC3CON_MODE                  1221
#define LC3MODE                       1222
#define LC3MODE1                      1223
#define CLC3CON_MODE1                 1224
#define LC3MODE2                      1225
#define CLC3CON_MODE2                 1226
#define LC3INTN                       1227
#define CLC3CON_INTN                  1228
#define CLC3CON_INTP                  1229
#define LC3INTP                       1230
#define CLC3CON_OUT                   1231
#define LC3OUT                        1232
#define LC3EN                         1233
#define CLC3CON_EN                    1234
#define CLC3POL                       1235
#define LC3G1POL                      1236
#define CLC3POL_G1POL                 1237
#define LC3G2POL                      1238
#define CLC3POL_G2POL                 1239
#define CLC3POL_G3POL                 1240
#define LC3G3POL                      1241
#define LC3G4POL                      1242
#define CLC3POL_G4POL                 1243
#define LC3POL                        1244
#define CLC3POL_POL                   1245
#define CLC3SEL0                      1246
#define CLC3SEL0_D1S0                 1247
#define LC3D1S0                       1248
#define LC3D1S                        1249
#define CLC3SEL0_D1S                  1250
#define LC3D1S1                       1251
#define CLC3SEL0_D1S1                 1252
#define LC3D1S2                       1253
#define CLC3SEL0_D1S2                 1254
#define LC3D1S3                       1255
#define CLC3SEL0_D1S3                 1256
#define LC3D1S4                       1257
#define CLC3SEL0_D1S4                 1258
#define CLC3SEL1                      1259
#define CLC3SEL1_D2S                  1260
#define CLC3SEL1_D2S0                 1261
#define LC3D2S                        1262
#define LC3D2S0                       1263
#define CLC3SEL1_D2S1                 1264
#define LC3D2S1                       1265
#define CLC3SEL1_D2S2                 1266
#define LC3D2S2                       1267
#define CLC3SEL1_D2S3                 1268
#define LC3D2S3                       1269
#define LC3D2S4                       1270
#define CLC3SEL1_D2S4                 1271
#define CLC3SEL2                      1272
#define CLC3SEL2_D3S0                 1273
#define LC3D3S                        1274
#define CLC3SEL2_D3S                  1275
#define LC3D3S0                       1276
#define LC3D3S1                       1277
#define CLC3SEL2_D3S1                 1278
#define LC3D3S2                       1279
#define CLC3SEL2_D3S2                 1280
#define LC3D3S3                       1281
#define CLC3SEL2_D3S3                 1282
#define LC3D3S4                       1283
#define CLC3SEL2_D3S4                 1284
#define CLC3SEL3                      1285
#define CLC3SEL3_D4S0                 1286
#define LC3D4S0                       1287
#define LC3D4S                        1288
#define CLC3SEL3_D4S                  1289
#define LC3D4S1                       1290
#define CLC3SEL3_D4S1                 1291
#define LC3D4S2                       1292
#define CLC3SEL3_D4S2                 1293
#define LC3D4S3                       1294
#define CLC3SEL3_D4S3                 1295
#define LC3D4S4                       1296
#define CLC3SEL3_D4S4                 1297
#define CLC3GLS0                      1298
#define CLC3GLS0_D1N                  1299
#define LC3G1D1N                      1300
#define LC3G1D1T                      1301
#define CLC3GLS0_D1T                  1302
#define LC3G1D2N                      1303
#define CLC3GLS0_D2N                  1304
#define CLC3GLS0_D2T                  1305
#define LC3G1D2T                      1306
#define CLC3GLS0_D3N                  1307
#define LC3G1D3N                      1308
#define LC3G1D3T                      1309
#define CLC3GLS0_D3T                  1310
#define CLC3GLS0_D4N                  1311
#define LC3G1D4N                      1312
#define CLC3GLS0_D4T                  1313
#define LC3G1D4T                      1314
#define CLC3GLS1                      1315
#define LC3G2D1N                      1316
#define CLC3GLS1_D1N                  1317
#define CLC3GLS1_D1T                  1318
#define LC3G2D1T                      1319
#define LC3G2D2N                      1320
#define CLC3GLS1_D2N                  1321
#define LC3G2D2T                      1322
#define CLC3GLS1_D2T                  1323
#define LC3G2D3N                      1324
#define CLC3GLS1_D3N                  1325
#define CLC3GLS1_D3T                  1326
#define LC3G2D3T                      1327
#define LC3G2D4N                      1328
#define CLC3GLS1_D4N                  1329
#define LC3G2D4T                      1330
#define CLC3GLS1_D4T                  1331
#define CLC3GLS2                      1332
#define LC3G3D1N                      1333
#define CLC3GLS2_D1N                  1334
#define LC3G3D1T                      1335
#define CLC3GLS2_D1T                  1336
#define CLC3GLS2_D2N                  1337
#define LC3G3D2N                      1338
#define CLC3GLS2_D2T                  1339
#define LC3G3D2T                      1340
#define CLC3GLS2_D3N                  1341
#define LC3G3D3N                      1342
#define LC3G3D3T                      1343
#define CLC3GLS2_D3T                  1344
#define CLC3GLS2_D4N                  1345
#define LC3G3D4N                      1346
#define CLC3GLS2_D4T                  1347
#define LC3G3D4T                      1348
#define CLC3GLS3                      1349
#define LC3G4D1N                      1350
#define CLC3GLS3_G4D1N                1351
#define LC3G4D1T                      1352
#define CLC3GLS3_G4D1T                1353
#define LC3G4D2N                      1354
#define CLC3GLS3_G4D2N                1355
#define CLC3GLS3_G4D2T                1356
#define LC3G4D2T                      1357
#define LC3G4D3N                      1358
#define CLC3GLS3_G4D3N                1359
#define CLC3GLS3_G4D3T                1360
#define LC3G4D3T                      1361
#define LC3G4D4N                      1362
#define CLC3GLS3_G4D4N                1363
#define LC3G4D4T                      1364
#define CLC3GLS3_G4D4T                1365
#define STATUS_SHAD                   1366
#define C_SHAD                        1367
#define DC_SHAD                       1368
#define Z_SHAD                        1369
#define WREG_SHAD                     1370
#define BSR_SHAD                      1371
#define PCLATH_SHAD                   1372
#define FSR0L_SHAD                    1373
#define FSR0H_SHAD                    1374
#define FSR1L_SHAD                    1375
#define FSR1H_SHAD                    1376
#define STKPTR                        1377
#define TOSL                          1378
#define TOSH                          1379

#endif // _PIC16LF1708_H_
